controllers/AdminController.php

    public function afterAction($action, $result)
    {
        $token = Yii::$app->request->headers->get('PsyAuth');
        $user_data = AesToken::decode($token);
        $user = User::findOne(['id' => $user_data['id'], 'access_token' => $token]);
---
SELECT * FROM `user` WHERE (`id`=12) AND (`access_token`='wVpkkf3VacTc6MdWu70nW1JgQ8NFP3WOC6f7T2M5Qawyx6A+6Ll9bEyKJRKkjCI/bTFTePopjdVHtW2OWPrVOGoG7ejUdPL93lj3FvKhJOt49ccGBU0Vj4f9xMAFruAIXXdhifVHRABVyXg8LLwyt2cuUmpKzPbRBeqExUvjUcU=')