controllers/SeanceController.php

    public function actionAll()
    {
        $req = Yii::$app->request;
        $spec_id = $req->get('specialistId');
        $goods = Good::find()->where(['specialist_id' => $spec_id])->all();
        $good_ids = [];
        foreach ($goods as $g) {
            $good_ids[] = $g->id;
        }
        $date = $req->get('date');
        $seances = Seance::find()->where(['in', 'good_id', $good_ids])->andWhere(['date' => $date])->orderBy('date')->asArray()->all();
---
SELECT * FROM `good` WHERE `specialist_id`='2'
SELECT * FROM `seance` WHERE (`good_id` IN (1, 2, 3)) AND (`date`='2019-11-11') ORDER BY `date`

    public function actionOne($id)
    {
        return Json::encode(Seance::find()->where(['id' => $id])->asArray()->one());
---
SELECT * FROM `seance` WHERE `id`='272'