controllers/SpecialistController.php

SELECT * FROM `specialist` WHERE `user_id`='11'
---
    public function actionAll()
    {
        $user_id = Yii::$app->request->get('userId');
        return Json::encode(
            Specialist::find()
                ->where(['user_id' => $user_id])
                ->asArray()
                ->all()
        );

SELECT * FROM `specialist` WHERE `id`='2'
---
    public function actionOne($id)
    {
        return Json::encode(Specialist::find()->where(['id' => $id])->asArray()->one());