controllers/UserController.php

    public function actionAll()
    {
        // $token = Yii::$app->request->headers->get('PsyAuth');
        // $user_data = AesToken::decode($token);
        // $user = User::findOne($user_data['id']);
        // if ($user) {
        //     throw new UnauthorizedHttpException();
        // }
        // return Json::encode(
        //     [
        //         'token' => $token,
        //         'user-token' => $user->access_token
        //     ]
        // );
        return Json::encode(
            User::find()
                ->where(['blocked' => 0])
                ->select(['id', 'organization_name', 'email', 'login', 'phone', 'specialists_quantity', 'parent_user_id', 'blocked'])
                ->asArray()
                ->all()
        );
---
SELECT `id`, `organization_name`, `email`, `login`, `phone`, `specialists_quantity`, `parent_user_id`, `blocked` FROM `user` WHERE `blocked`=0

    public function actionAllBlocked()
    {
        return Json::encode(
            User::find()
                ->where(['blocked' => 1])
                ->select(['id', 'organization_name', 'email', 'login', 'specialists_quantity', 'parent_user_id', 'blocked'])
                ->asArray()
                ->all()
        );
---
SELECT `id`, `organization_name`, `email`, `login`, `specialists_quantity`, `parent_user_id`, `blocked` FROM `user` WHERE `blocked`=1

    public function actionOne($id)
    {
        return Json::encode(User::find()->where(['id' => $id])->asArray()->one());
---
SELECT * FROM `user` WHERE `id`='11'

    public function actionUpdate()
    {
        $req = Yii::$app->request;
        $id = $req->post('id');
        $user = User::findOne($id);
---
SELECT * FROM `user` WHERE `id`=13

    public function actionUnlock()
    {
        $id = Yii::$app->request->post('id');
        $user = User::findOne($id);
        $user->blocked = 0;
        if ($user->save()) {
---
SELECT * FROM `user` WHERE `id`=13
UPDATE `user` SET `blocked`=0 WHERE `id`=13

    public function actionChildren($id)
    {
        return Json::encode(
            User::find()
                ->where(['parent_user_id' => $id])
                ->asArray()
                ->all()
        );
---
SELECT * FROM `user` WHERE `parent_user_id`='11'