controllers/UserController.php

SELECT `id`, `organization_name`, `login`, `specialist_quantity`, `parent_user_id`, `blocked` FROM `user` WHERE `blocked`=0
---
    public function actionAll()
    {
        return Json::encode(
            User::find()
                ->where(['blocked' => 0])
                ->select(['id', 'organization_name', 'login', 'specialists_quantity', 'parent_user_id', 'blocked'])
                ->asArray()
                ->all()
        );

SELECT * FROM `user` WHERE `id`='2'
---
    public function actionOne($id)
    {
        return Json::encode(User::find()->where(['id' => $id])->asArray()->one());